1. Перебор списка (в том числе многомерного)
s = [bi,li,ti,li]
for i in s:
  print(i)
2. Генерация всех комбинаций
I

II
a = product('wefui', repeat=3)
3. Анализ пар в списке
s=[1,2,3,4,5]
for item in range (0, len(s)-1):
  if s[item] == s[item+1]
4. Сортировка перестановками
I
if s[item] == s[item+1]
II
a,b=b,a
5. Метод итераций или измерение на равноудаленных промежутках
6. Рекурсия
7. Метод половинного деления
8. Поиск максимума или убить дракона
s = max(ke,s)
9. Если верен каждый или если где-то плохо, то все плохо
if all(jol%c!=0 for c in range(1,jol-1)
10 Преоьраования типов (строка>число и оратно)
b ="23424234234"
int(b)
a =834576
str(a)
